package cn.yesomething.utils;

import java.util.regex.*;

public class YellowViolenceKiller {
    //根据关键词生成的正则表达式
    private static String regexp = "裸舞视|口射|原味内衣|阴道|蜜液|自慰|马勒|狼友|阴唇|轮功|falungong|flg|粉嫩"+
                                    "|zi杀|玉乳|电鸡|潮吹|迷药|美逼|爽片|奸情|迷藥|中年美妇|裸露|摸奶|成人dv|金麟岂是池中物"+
                                    "|妹上门|性奴集中营|淫威|奶子|裸聊网|色b|肉欲|肏你|阴户|屁眼|迷幻药|精神药品|仓井空|g片"+
                                    "|口活|谜奸药|男公关|淫浪|浑圆|淫荡|傻比|xiao77|集体自杀|淫虫|沙比|tokyohot|杀b|狗草|黄片"+
                                    "|色逼|食精|暴淫|售氯胺|双臀|操逼|a4y|扌由插|淫声浪语|色情服务|性伴侣|舔脚|被干|包二奶|淫魔"+
                                    "|淫贱|写真|售防身|小穴|迷奸药|激情|精液|肥逼|大力抽送|爱女人|淫照|就去日|肉洞|骚浪|售五四|兽交"+
                                    "|后庭|中国教徒|成人网站|售手枪|揉乳|草你妈|刺激|色电影|淫兽学园|摇头丸|一本道|售枪支|法x功|枪销售"+
                                    "|骚妇|荡妇|偷欢|手淫|成人论坛|草泥马|电话交友|下贱|淫叫|暴奸|色界|淫书|混蛋|屁股|喷精|赤裸|少年阿宾"+
                                    "|色盟|成人卡通|成人文|一ye情|美艳少妇|电话窃听|性饥渴|后穴|九ping|砲友|校鸡|爆乳|开苞|淫术炼金士"+
                                    "|风月大陆|淫乱|欲火|卧艹|寂寞男|调教|淫荡视频|乖乖粉|风骚|淫教师|sm|贱b|别他吗|干你|释欲|售三棱|自fen"+
                                    "|迷昏药|正见网|熟母|性虎|阴茎|三级片|鸡吧|玉蒲团|傻b|操他妈|大纪元|淫荡照片|一夜情|fa轮|阴茎增大|肉穴"+
                                    "|乱伦类|色小说|推背图|胸推|淫虐|妹按摩|售子弹|爆你菊|脚交|惹火身材|按摩棒|成人视|裸陪|小逼|草你丫"+
                                    "|诺查丹玛斯|阴阜|男奴|媚外|枪货到|艳情小说|炮友|伦理电影|白嫩|买春|hardcore|色情网站|杨思敏|巨乳|口淫"+
                                    "|兼职|煞逼|女优|狗娘养|艹你|全家死光|粉穴|妓女|插暴|法轮|插逼|裙中性运动|法0功|酥痒|淫色|售火药|枪械制"+
                                    "|浪妇|淫液|豪乳|我就色|欲仙欲死|色视频|裹本|成人小|淫情女|干你娘|阴精|叫床|性息|车仑工力|裤袜|淫河"+
                                    "|tuidang|自拍|麻痹的|淫糜|黑逼|色诱|全家死绝|淫兽|迷魂香|阳具|舔阴|陰戶|诸世纪|集体淫|内裤|发情|淫女"+
                                    "|日你妈|志洪李|发论工|白痴|草你吗|色欲|色情影片|淫水|熟女|援交|咪咪|根达亚文明|枪模|售步枪|你妈逼|肉逼"+
                                    "|套弄|作爱|性伙伴|鸡巴|下体|幼交|轮法功|肉缝|少妇|娘西皮|肛门|乱交|呻吟|骚逼|伦理大|色情电影|美女裸体"+
                                    "|死全家|退党|自sha|藏字石|淫情|捏弄|轮操|欠干|口交|脱光|色情图片|我干|和弦|兽奸|阴部|婊子养的|成人小说"+
                                    "|快感|sexinsex|艹你妈|口爆|美少妇|前凸后翘|操我|性欲|dajiyuan|操死|色情表演|大乳|我草|浪叫|学生妹|汤加丽"+
                                    "|幼男|聊性|骚货|无修正|超越红墙|狂操|逢8必灾|我操|强奸|丝袜|售猎枪|爆草|狗杂种|cao你|9评|sm女王|卧槽"+
                                    "|性福情|明慧周报|阴蒂|性感妖娆|抽插|乱伦小|售虎头|乳交|三去车仑|枪出售|淫娃|枪手|你吗b|逼奸|按摩|操你妈"+
                                    "|18禁|济世灵文|婊子|强jian|群交|日逼|招鸡|逢9必乱|淫妇|morphine|肉具|骚女|电话监|潮喷|成人游戏|拔出来"+
                                    "|体位|操你全家|凌辱|a4u|菊门|售麻醉|情趣用品|淫靡|淫荡自慰器|推bei图|金鳞岂是池中物|性奴|伦理片|无码"+
                                    "|少修正|a片|成人色情|朱瑟里诺|摸胸|抓胸|穴图|高潮|售假币|屌|新唐人|福音会|失身粉|精子|鸡奸|肛交|密穴"+
                                    "|性虐|做爱|售纯度|人类灭亡进程表|amateur|氵去车仑|插阴|secom|骚嘴|性感诱惑|售军用|爱液|脱内裤|好嫩"+
                                    "|强奸处女|法o功|fuck|浪逼|迷魂藥|xing伴侣|几吧|你妈的|舞女|轮奸|迷情水|narcotic|兽性|妈逼|性交图片"+
                                    "|迷情粉|性服务|擦你妈|干死|逢八必灾|性技巧|大法弟子|淫亵|人渣|抽一插|颜射|售左轮插你|妈了个逼|肉茎|美幼"+
                                    "|肉棍|要射了|暴干|嫩逼|强暴|射精|陰唇|成人聊|穴口|丝诱|盗撮|阴茎助勃|电击枪|你他妈|肉唇|adult|迷情药|菊穴"+
                                    "发生关系|暴乳|吃精|猛男|李宏志|g点|张筱雨|麻醉药|射颜|骚水|刹笔|淫妻|虎骑|兽欲|淫肉|被插|淫騷妹|裸照|操黑"+
                                    "|奈美|拳交|贱货|裸体写真|色妹妹|插b|售热武|色情小说|偷拍|美女写真|逢九必乱|放尿|射爽|乱奸|日烂|火辣|淫穴"+
                                    "|titor|浪女|性交|小xue|统一教|售一元硬|煞笔|乳头|露b|蜜穴|轮暴|插我|骚穴|阉割|伦理毛|美乳|曹尼玛|迷魂药"+
                                    "|干死你|阴核|漏乳|9ping|售弹簧刀|肏死|母奸|无耻|李洪志|操你祖宗|成人图|人妻|亚情|玉穴|巨屌|乳爆|真他妈"+
                                    "|电话追杀系统|枪的制|淫魔舞|内射|成人文学|夜勤病栋|明慧网|吸精|色情片|售狗子|被操|anal|阴间来电|情色|应召"+
                                    "|幼女|色猫|我日你|阴毛|fl功|巨奶|迷奸粉|迷昏藥|菊花洞|迷幻藥|相奸|gay片|招妓|售单管|封面女郎|骚比|铃声|欲女"+
                                    "|按照马雅历法|贱人|插进|推油|一丝不挂|嫩女|裸聊|成人电影|操你娘|体奸|porn|限量|厕奴|全家不得好死|不穿|成人电"+
                                    "|淫媚|嫩穴|法lun|装b|死逼|国产av|花花公子|枪子弹|秘唇|发浪|淫样|轮子功|盘古|h动画|干穴|大波|干你妈|电狗"+
                                    "|寂寞女|操烂|色色|h动漫|法lg|玉女心经|援助交际|贱比|电警棒|美腿|大sb|清海无上师|狂插|操你大爷|铃木麻|你麻痹"+
                                    "|人兽|熟妇|淫母|乳房|美女上门|诱奸|品香堂|电话拦截器|性爱|jiuping|屄|美穴|迷奸|阴b|sb|狗操|多人轮|换妻俱乐部"+
                                    "|流淫|电话定位器|处男|退dang|99bb|荡女|九评|傻逼|一夜欢|肉棒|枪决女犯|乳沟|淫电影|龟头|性交视频|夏川纯"+
                                    "|淫荡美女|插比|真善忍|陰道|suicide|迷昏口|成人片|性感少|乱伦|色区|爽死我了|干逼|伪火|全裸|文做|观音法门|春药"+
                                    "|法一轮一功|售健卫|狗日的|淫兽学|incest|松岛枫|yin荡|法轮功|乳罩|乳峰|乳肉";

    /**
     * 判断消息是否含有黄暴信息
     * @param messageContext 需要判断的消息
     * @return 含有黄暴信息返回true
     */
    public static boolean judge(String messageContext){
        Pattern pattern = Pattern.compile(regexp);
        Matcher matcher = pattern.matcher(messageContext);
        return matcher.find();
    }

    /**
     * 判断消息是否含有黄暴信息
     * @param messageContext 需要判断的消息
     * @return 将黄暴信息转化为*符号
     */
    public static String replace(String messageContext){
        return messageContext.replaceAll(regexp,"*");
    }
}